In [3]:
import pandas as pd
import requests

In [6]:
url="https://raw.githubusercontent.com/edlich/eternalrepo/master/DS-WAHLFACH/countries.csv"
r = requests.get(url)
open('countries.csv', 'wb').write(r.content)
df = pd.read_csv('countries.csv')
df = df[['Name','People','Area','BIP','Currency']]

In [7]:
df.head()

       Name     People     Area   BIP Currency
0   Germany   82521653   357385  3466      EUR
1     Japan  126045000   377835  4938      YEN
2    Canada   36503097  9984670  1529      CAD
3     Italy   60501718   301338  1850      EUR
4  Brazilia  208360000  8515770  1798     REAL

In [8]:
df.count(0)

Name        5
People      5
Area        5
BIP         5
Currency    5
dtype: int64

In [9]:
df.min()

Name        Brazilia
People      36503097
Area          301338
BIP             1529
Currency         CAD
dtype: object

In [10]:
df.max()

Name            Japan
People      208360000
Area          9984670
BIP              4938
Currency          YEN
dtype: object

In [12]:
df.mean(numeric_only=True)

People    102786293.6
Area        3907399.6
BIP            2716.2
dtype: float64

In [13]:
df.tail(4)

       Name     People     Area   BIP Currency
1     Japan  126045000   377835  4938      YEN
2    Canada   36503097  9984670  1529      CAD
3     Italy   60501718   301338  1850      EUR
4  Brazilia  208360000  8515770  1798     REAL

In [14]:
df.loc[df['Currency'] == 'EUR']

      Name    People    Area   BIP Currency
0  Germany  82521653  357385  3466      EUR
3    Italy  60501718  301338  1850      EUR

In [15]:
df_new = df[['Name', 'Currency']].copy()

In [16]:
df_new.head()

       Name Currency
0   Germany      EUR
1     Japan      YEN
2    Canada      CAD
3     Italy      EUR
4  Brazilia     REAL

In [17]:
df.loc[df['BIP'] > 2000]

      Name     People    Area   BIP Currency
0  Germany   82521653  357385  3466      EUR
1    Japan  126045000  377835  4938      YEN

In [18]:
df.loc[(df['People'] > 5*(10**7)) & (df['People'] < 15*(10**7))]

      Name     People    Area   BIP Currency
0  Germany   82521653  357385  3466      EUR
1    Japan  126045000  377835  4938      YEN
3    Italy   60501718  301338  1850      EUR

In [19]:
df.rename(columns={'BIP': 'Bip'})

       Name     People     Area   Bip Currency
0   Germany   82521653   357385  3466      EUR
1     Japan  126045000   377835  4938      YEN
2    Canada   36503097  9984670  1529      CAD
3     Italy   60501718   301338  1850      EUR
4  Brazilia  208360000  8515770  1798     REAL

In [20]:
df.rename(columns={'BIP': 'Bip'})['Bip'].sum(axis=0)

13581

In [21]:
df['People'].mean(axis=0)

102786293.6

In [22]:
df.sort_values('Name', axis=0, ascending=True)

       Name     People     Area   BIP Currency
4  Brazilia  208360000  8515770  1798     REAL
2    Canada   36503097  9984670  1529      CAD
0   Germany   82521653   357385  3466      EUR
3     Italy   60501718   301338  1850      EUR
1     Japan  126045000   377835  4938      YEN

In [23]:
import numpy as np
df_new2 = df.copy()
df_new2['Area'] = np.where(df_new2['Area']>=1000000, 'BIG', 'SMALL')
df_new2.head()

       Name     People   Area   BIP Currency
0   Germany   82521653  SMALL  3466      EUR
1     Japan  126045000  SMALL  4938      YEN
2    Canada   36503097    BIG  1529      CAD
3     Italy   60501718  SMALL  1850      EUR
4  Brazilia  208360000    BIG  1798     REAL